---
name: 9.2.5
title: 9.2.5 - IPv6 RS & RA Redundancy
short-title: IPv6 RS & RA Redundancy
category: 9.2 First Hop Redundancy Protocols
collection: network-services
layout: page
exam: both
sidebar: services_sidebar
permalink: 9.2.5.html
folder: network-services
---
#### RA Message as Substitute for FHRP

Since IPv6 has Router Advertisement messages, it may seem at first glance that FHRPs are not needed. If a host has connectivity to a network segemnt with multiple IPv6 routers, and those routers are sending out RAs advertising themselves as the default gateway, then shouldn't the host know of the availability of all routers on the network?
```
Client# show ipv6 routers
Router FE80::3 on FastEthernet0/0, last update 0 min
  Hops 64, Lifetime 1800 sec, AddrFlag=0, OtherFlag=0, MTU=1500
  HomeAgentFlag=0, Preference=Medium
  Reachable time 0 (unspecified), Retransmit time 0 (unspecified)
  Prefix 2001:DB8:0:1::/64 onlink autoconfig
    Valid lifetime 2592000, preferred lifetime 604800
Router FE80::5 on FastEthernet0/0, last update 1 min
  Hops 64, Lifetime 1800 sec, AddrFlag=0, OtherFlag=0, MTU=1500
  HomeAgentFlag=0, Preference=Medium
  Reachable time 0 (unspecified), Retransmit time 0 (unspecified)
  Prefix 2001:DB8:0:1::/64 onlink autoconfig
    Valid lifetime 2592000, preferred lifetime 604800
```
We see in this example a host could know of multiple routers solely through RAs. However, there is no graceful failover associated with this. The host will select one default gateway out of the two RAs it received in this example. Should that device fail unexpectedly, the failover would take roughly 40 seconds. In addition, new connections will still start through the failed gateway for a period of time equal to the lifetime set in the failed device's RA.

However, by tuning the RA lifetime and advertisement interval, we can drastically reduce the convergence time.
```
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ipv6 nd ra interval msec 300
R1(config-if)# ipv6 nd ra lifetime 1
```
By tuning the RA timners down to this, we can actually obtain 1 second failover using just RA messages! If you need sub-second failover, you should look to HSRP or GLBP for IPv6.
#### HSRP for IPv6
HSRP has a virtual MAC address similarly derived as the IPv4 version. It has a range of 4096 addresses, from 0005.73A0.000 through 005.73A0.0FFF. It also has a virtual link-local address that is derived form the virtual MAC address. Periodic RAs are sent for the IPv6 link-local address when the HSRP group is active. HSRP for IPv6 uses UDP port 2029.
```
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ipv6 address 2001:DB8:CAFE:2200::1/64
R1(config-if)# standby version 2
R1(config-if)# standby 1 priority 120
R1(config-if)# standby 1 preempt delay minimum 30
R1(config-if)# standby 1 track interface GigabitEthernet0/0
R1(config-if)# exit
```
If you use the **show standby** command with this configuration, you will notice that the IPv6 virtual IP was assigned automatically, and because of the RA advertisements of IPv6, the hosts learn it automatically. You can also assign it manually.
```
R1# show standby
GigabitFastEthernet0/1 - Group 1 (version 2)
State is Active
2 state changes, last state change 5w5d
Active virtual MAC address is 0000.0c9f.f065
Local virtual MAC address is 0000.0c9f.f065 (v2 default)
Hello time 3 sec, hold time 10 sec
Next hello sent in 2.296 secs
Authentication text "ese"
Preemption enabled, delay min 30 secs
Active router is local
Priority 120 (configured 120)
Track interface GigabitEthernet0/0 state Up decrement 90
IP redundancy name is "hsrp-Fa0/0.100-1" (default)
```
#### GLBP for IPv6
As with HSRP, the only major difference between IPv4 and IPv6 GLBP is that you do not *have* to manually configure an IPv6 virtual IP address. If you do not, one is assigned automatically. The rest of the configuration options remain similar.
```
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ipv6 address 2001:DB8:CAFE:2200::1/64
R1(config-if)# glbp 1 ipv6 FE80::260:3EFF:FE11:6770
R1(config-if)# glbp 1 priority 200
R1(config-if)# glbp 1 preempt
R1(config-if)# exit
```