---
name: 9.3.10
title: 9.3.10 - Stateful & Stateless DHCPv6
short-title: Stateful & Stateless DHCPv6
category: 9.3 DHCP
collection: network-services
layout: page
exam: both
sidebar: services_sidebar
permalink: 9.3.10.html
folder: network-services
---
We talked about the differences between stateful and stateless DHCPv6 in our previous post. This post will focus more on configuration.

#### Stateless
Stateless DHCPv6 configuration is a 3 step process:
1. Configure a DHCPv6 server pool name with configuration parameters.
2. Enable the DHCPv6 server pool on an interface.
3. Modify any Router Advertisement parameters to let the hosts know that other configuration information is available from a DHCPv6 server

Here is how to configure a DHCPv6 pool:
```
R1(config)# ipv6 dhcp pool TEST
R1(config-dhcpv6)# dns-server 2001::1:1
R1(config-dhcpv6)# domain internetbrew.com
R1(config-dhcpv6)# exit
```
Notice with stateless configuration we do not assign any addresses to the pool.

Next, we enable the DHCP service on an interface and assign a pool.
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ipv6 dhcp server TEST
```

Finally, we must change the RA message to tell hosts that there is more configuration information available. This is done at the interface level.
```
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ipv6 nd other-config-flag
```

#### Stateful
For stateful DHCPv6 configuration, you also need to allocate an address prefix that can be distributed to the clients. The other configuration options remain the same.
```
R1(config)# ipv6 dhcp pool TEST
R1(config-dhcpv6)# address prefix 2010:AA01:10::/64 lifetime infinite infinite
R1(config-dhcpv6)# dns-server 2001::1:1
R1(config-dhcpv6)# domain internetbrew.com
R1(config-dhcpv6)# exit
```

You must remember when using Stateful DHCPv6, subnet information is not passed by the DHCPv6 service. It instead comes from the RA messages.