---
name: 9.4.1
title: 9.4.1 - IOS Authoritative DNS Server
short-title: IOS Authoritative DNS Server
category: 9.4 DNS
collection: network-services
layout: page
exam: both
sidebar: services_sidebar
permalink: 9.4.1.html
folder: network-services
---
Cisco introduced the ability to have your DNS server act as an authoritative server starting in version 12.3. To configure a router to act as primary DNS server for a zone, use the **ip dns primary** command as below.
```
R1(config)# ip dns server
R1(config)# ip dns primary internetbrew.com soa ns1.intermnetbrew.com admin@internetbrew.com 86400 3600 1209600 86400
```
The timer values in order are refresh time, refresh retry time, authority expire time, and minimum TTL for the zone. Next, to declare primary and secondary name servers for the domain, use the **ip host ns** command.
```
R1(config)# ip host internetbrew.com ns ns1.internetbrew.com
R1(config)# ip host internetbrew.com ns ns2.internetbrew.com
```
You can optionally define mail routing for the domain using the **ip host mx** command.
```
R1(config)# ip host internetbrew.com mx 10 mail1.internetbrew.com
R1(config)# ip host internetbrew.com mx 20 mail2.internetbrew.com
```
The last step is defining the hosts within your name. After all, that is the whole point of this, right?
```
R1(config)# ip host ns1.internetbrew.com 192.168.17.1
R1(config)# ip host ns2.internetbrew.com 192.168.17.2
R1(config)# ip host mail1.internetbrew.com 192.168.17.3
R1(config)# ip host mail2.internetbrew.com 192.168.17.4
```
The router is now set up to be authoritative for the internetbrew.com domain.
