---
name: 9.5.8
title: 9.5.8 - NAT with Overlapping Subnets
short-title: NAT with Overlapping Subnets
category: 9.5 NAT
collection: network-services
layout: page
exam: both
sidebar: services_sidebar
permalink: 9.5.8.html
folder: network-services
---
There are two ways to deal with overlapping subnets with NAT (though re-addressing is the correct solution). The preferred real world method would be to have both routers attached to the overlapping networks use static network-to-network mappings on both their routers to mask the overlapping segments, and never advertise the subnets that overlap. In reality, you would need DNS servers on both overlapping subnets to provide the outside local address for any hosts they needed to reach on the other overlapping subnet. Let's look at an example where two networks that have border routers R1 and R2 both are addressed with 10.0.0.0/24
```
R1(config)# ip nat inside source static network 10.0.0.0 11.0.0.0 /24
R1(config)# ip nat outside source static 11.0.0.50 10.0.0.50
```
R2(config)# ip nat inside source static network 10.0.0.0 22.0.0.0 /24
R2(config)# ip nat outside source static 22.0.0.50 10.0.0.50
```
With this configuration traffic from the R1 10.0.0/24 network would look to R2 as if it were coming from 11.0.0.0/24 and traffic from R2 would look to R1 as if it were coming from 22.0.0.0/24. For any servers that needed to be reached you could perform outside source translation, and advertsie the outside global address via DNS to the other network.

You could also advertise the subnet from one router, and then perform NAT translations for the overlapping inside local address space on the second router. Perhaps the use case for this is that minimal traffic needs to enter only one subnet from the other, so you do not want to reconfigure two routers and suffer the maintenance window.
```
R1(config)# ip nat pool R2_MASQUERADE 22.0.0.1 22.0.0.254 prefix-length 24
R1(config)# ip access-list 10 permit 10.0.0.0 0.0.0.255
R1(config)# ip nat outside source list 10 pool R2_MASQUERADE
R1(config)# ip nat inside source static network 10.0.0.0 11.0.0.0 /24
R1(config)# ip route 11.0.0.0 255.255.255.0 Null0
R1(config)# ip route 22.0.0.0 255.255.255.0 GigabitEthernet0/1.13
R1(config)# interface Loopback10
R1(config-if)# ip nat inside
R1(config-if)# interface GigabitEthernet0/1.13
R1(config-if)# ip nat outside
R1(config-if)# exit
R1(config)# router rip
R1(config-router)# redistribute static
R1(config-router)# end
```
Then on R2, we would just advertise the 10.0.0.0 network via RIP.
```
R2(config)# router rip
R2(config-router)# network 10.0.0.0
R2(config-router)# end
```
The net result of this configuration, is that if R2 sends a packet to R1 destined to 11.0.0.1 with a source of 10.0.0.1, the destination address is translated to 10.0.0.1 by R1 and the source address is translated to 22.0.0.2.

