---
name: 9.5.1
title: 9.5.1 - Basic NAT
short-title: Basic NAT
category: 9.5 NAT
collection: network-services
layout: page
exam: both
sidebar: services_sidebar
permalink: 9.5.1.html
folder: network-services
---
NAT is a relatively easy complex, but understanding the definitions and terminology takes a bit. There is the difference between *inside* and *outside*. Typically inside is a private enterprise and the outside is the public internet. There is also *local* vs *global*. A local address is an address that is seen by devices on the inside, and a global address is an address that is seen by devices on the outside. Given these four terms, an address involved in NAT translation may be one of four types.
- **Inside Local**: address assigned to inside devices that are not advertised outside
- **Inside Global**: address by which an inside device is known to the outside
- **Outside Global**: address assigned to outside device that is not advertised to the inside
- **Outside Local**: address by which outside device is known to the inside

Inside global addresses are mapped to inside local addresses and outside local addresses are mapped to outside global addresses.

There is also static and dynamic NAT. They are exactly how they sound. Static NAT has 1:1 mappings of local and global addresses. Dynamic mappings may be one-to-many or many-to-one. Many to one is our classic NAT where many devices are mapped to the same inside global address. One-to-many is the case where we have a dynamic pool and any single address could be mapped to one of several inside global IP addresses.

IOS has a *translation timeout* that specifies how long entries should be held in the NAT table. The default is 86400 seconds (24 hours) and can be changed with **ip nat translation timeout**. There are actually many different timeout periods that can be specified.
```
R1(config)#ip nat translation ?
  arp-ping-timeout        Specify timeout for WLAN-NAT ARP-Ping
  dns-timeout             Specify timeout for NAT DNS flows
  finrst-timeout          Specify timeout for NAT TCP flows after a FIN or RST
  icmp-timeout            Specify timeout for NAT ICMP flows
  max-entries             Specify maximum number of NAT entries
  port-timeout            Specify timeout for NAT TCP/UDP port specific flows
  pptp-timeout            Specify timeout for NAT PPTP flows
  routemap-entry-timeout  Specify timeout for routemap created half entry
  syn-timeout             Specify timeout for NAT TCP flows after a SYN and no
                          further data
  tcp-timeout             Specify timeout for NAT TCP flows
  timeout                 Specify timeout for dynamic NAT translations
  udp-timeout             Specify timeout for NAT UDP flows
```
You can see the **max-entries** option could be helpful for NAT based DoS attacks.

Let's look at some examples. The first example we will define a one-to-one static NAT.
```
R1(config)# ip nat inside source static 155.1.146.4 155.1.13.2
R1(config)# interface GigabitEthernet0/1.146
R1(config-if)# ip nat inside
R1(config-if)# interface GigabiteEthernet0/1.13
R1(config-if)# ip nat outside
R1(config-if)# end
```
Now, let's look at our NAT table after performing a ping from 155.1.146.4 to 155.1.13.3:
```
R1# sh ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
icmp 155.1.13.2:4      155.1.146.4:4      155.1.13.3:4       155.1.13.3:4
--- 155.1.13.2         155.1.146.4
```
We see that as expected, 155.1.146.4 is translated to 155.1.13.2 when transit traffic passes between the configured router's **ip nat inside** and its **ip nat outside** interfaces. It is key to remember that NAT is transparent to the end devices involved.

For our next example, we will look at translating a group of inside local addresses to a pool of inside global addresses. This is often referred to as Dynamic NAT.
```
R1(config)# access-list 10 permit 155.1.146.0 0.0.0.255
R1(confg)# ip nat pool MYPOOL 155.1.13.100 155.1.13.110 prefix-length 24
R1(config)# ip nat inside source list 10 pool MYPOOL
R1(config)# interface GigabitEthernet0/1.146
R1(config-if)# ip nat inside
R1(config-if)# interface GigabiteEthernet0/1.13
R1(config-if)# ip nat outside
R1(config-if)# end
```
If you look at the NAT table you will see the translation used one of the addresses from the pool for the inside global address:
```
R1# sh ip nat transl
Pro Inside global      Inside local       Outside local      Outside global
icmp 155.1.13.100:0    155.1.146.6:0      155.1.13.3:0       155.1.13.3:0
icmp 155.1.13.100:1    155.1.146.6:1      155.1.13.3:1       155.1.13.3:1
--- 155.1.13.100       155.1.146.6        ---                ---
```
One thing to note on Dynamic NAT - once the NAT is set up in the NAT table, the session is reversible and external clients trying to reach the global address will be translated to its local address counterpart.

Next, let's look at a Port Address Translation (PAT) example. You may also hear this reffered to as address overloading, NAPT, or IP masquerading. The key to its configuration is the word **overload**.
```
R1(config)# access-list 10 permit 155.1.146.0 0.0.0.255
R1(config)# ip nat inside source list 10 interface GigabitEthernet0/1.13 overload
R1(config)# interface GigabitEthernet0/1.146
R1(config-if)# ip nat inside
R1(config-if)# interface GigabiteEthernet0/1.13
R1(config-if)# ip nat outside
R1(config-if)# end
```
Not the **overload** keyword we pointed out. This enables address overloading and enables the use of socket translation. Also notice on this configuration that for our inside global address, instead of using a pool or a static address, in this example we just used the **interface** keyword. This will simply translate to the IP address assigned to the defined interface. And if we ping from two separate devices from the inside interface, we can see that two different ports are used in the translation.
```
R1# sh ip nat trans
Pro Inside global      Inside local       Outside local      Outside global
icmp 155.1.13.1:5      155.1.146.4:5      155.1.13.3:5       155.1.13.3:5
icmp 155.1.13.1:2      155.1.146.6:2      155.1.13.3:2       155.1.13.3:2
```

NAT can translate addresses in both directions. This has always been confusing to me. On example of translating an outside global address to an outside local address is if you wanted an external address to appear as if it is part of the same internal network.
```
R1(config)# ip nat outside source static 155.1.13.3 155.1.147.3
R1(config)# interface GigabitEthernet0/1.146
R1(config-if)# ip nat inside
R1(config-if)# interface GigabiteEthernet0/1.13
R1(config-if)# ip nat outside
R1(config-if)# end
```
Now, traffic that enters ingress to interface GigabitEthernet0/1.13 from 155.1.13.1 and traverses interface GigabitEthernet0/1.146 will appear to be from 155.1.146.3. We see the results in the NAT table.
```
R1# sh ip nat translations
Pro Inside global      Inside local       Outside local      Outside global
--- ---                ---                155.1.147.3       155.1.13.3
icmp 155.1.146.4:0     155.1.146.4:0      155.1.147.3:0     155.1.13.3:0
```
Note that when doing outside NAT across routers, there must be a routing table match to get the return traffic back to the translated address.

The NAT order of operations is different for Inside to Outside NAT vs Outside to Inside NAT. For Inside to Outside, packets are "routed" first and then NATd second. What routed means in this context is an interface is chosen. For Outside to Inside packets are NATd first and then routed second.