---
name: 3.2.8
title: 3.2.8 - IPv6 Filtering
short-title: IPv6 Filtering
category: 3.2 IPv6
collection: general-routing
layout: page
exam: both
sidebar: general-routing_sidebar
permalink: 3.2.8.html
folder: general-routing
---
### Access Lists
```
Router(config-ipv6-acl)# deny ipv6 2001:db8:0:12::/64 any
```
You can see above that one big difference with IPv6 access lists is that there is no longer a wildcard ,all. The IPv6 subnet is easily declared in CIDR notation.

In IPv4 if we were applying access list 1 to an interface, we would do so with the **ip access-group 1** command. With IPv6, that command has been replaced with **ipv6 traffic-filter**.
```
Router(config)# interface GigabitEthernet0/1
Router(config-if)# ipv6 traffic-filter 1
```

### Prefix Lists
You can use prefix lists for filtering in much the same way as you could with IPv4 prefix lists. You declare the prefix list in general configuration mode with **ipv6 prefix-list <prefix-name>** and then apply the prefix on the desired routing protocol using the **distribute-list prefix-list <list-name>** command in router configuration mode.
```
R1(config)# ipv6 unicast-routing
R1(config)# ipv6 prefix-list ipv6_all seq 10 permit AB00::/1/128
R1(config)# ipv6 prefix-list ipv6_all seq 20 permit AB10::/1/128
R1(config)# ipv6 prefix-list ipv6_all seq 30 permit AB20::/1/128
```
And then we would apply it on the routing protocol configuration, just as in IPv4.
```
R1(config)# ipv6 router ospf 10
R1(config-router)# router-id 2.2.2.2
R1(config-router)# distribute-list prefix-list ipv6_all in
R1(config-router)# exit
```
