---
name: 3.5.8.1
title: 3.5.8.1 - Enabling EIGRPv6
short-title: Enabling EIGRPv6
category: 3.5 EIGRP
collection: eigrp
layout: page
exam: both
sidebar: eigrp_sidebar
permalink: 3.5.8.1.html
folder: eigrp
---
EIGRPv6 is very similar to EIGRP for IPv4. The transport mechanism is via protocol 88 and uses both multicast and unicast transmission. The IPv6 multicast address is FF02::A (FF02:: is equivalent to 224.0.0 and A is 10). EIGRPv6 can be configured in both classic mode and named mode. There are a few gotchas in each mode.

First, for both modes, IPv6 unicast routing must be enabled globally on the router. Also, for both modes there is no **network** statement.

For classic mode, instead of using the **network** command, you must go to each interface you want to run EIGRP and issue the command **ipv6 eigrp \<asn\>**. If you are not running IPv4, make sure you specify a 32-bit router ID.
```
`R1(config)# ipv6 unicast-routing
R1(config)# ipv6 router eigrp 100
R1(config-router)# eigrp router-id 1.1.1.1
R1(config-router)# exit
!
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ipv6 enable
R1(config-if)# ipv6 eigrp 100
R1(config-if)# exit
```
`
With named mode, as soon as we define the autonomous-system, EIGRP is enabled on *all* interfaces by default. If you need to disable an interface, then you must g into af-interface mode and shutdown that interface. Alternatively, you can alter the af-interface default to shutdown, and then enable EIGRP on a per af-interface basis.
```
`Router(config)# router eigrp virtual-name 
Router(config-router)# address-family ipv4 autonomous-system 4453
R1(config-router-af)# af-interface default
R1(config-router-af-interface)# shutdown 
R1(config-router-af-interface)# exit
R1(config-router-af)# af-interface Ethernet 0/0 
R1(config-router-af-interface)# no shutdown 
R1(config-router-af-interface)# exit-af-interface
R1(config-router-af)# 
```
`
EIGRPv6 can be configured in named mode on one router and then in classic mode on another router, and neighbor relationships and route exchange will occur without issue, if both ends are configured correctly.