---
name: 3.5.7.7
title: 3.5.7.7 - EIGRP Route Tag Enhancements
short-title: EIGRP Route Tag Enhancements
category: 3.5 EIGRP
collection: eigrp
layout: page
exam: both
sidebar: eigrp_sidebar
permalink: 3.5.7.7.html
folder: eigrp
---
A route tag is a 32-bit value attached to routes. Route tags are used to filter routes and apply administrative policies, such as redistribution and route summarization, to tagged routes. You can tag routes within a route map by using the **set tag** command. You can match tagged routes and apply administrative policies to tagged routes within a route map by using the **match tag** or **match tag list** command. The **match tag list** command is used to match a list of route tags.

Prior to the EIGRP Route Tag Enhancements feature, EIGRP routes could only be tagged using plain decimals (range: 1 to 4294967295). This feature enables users to specify and display route tag values as dotted decimals (range: 0.0.0.0 to 255.255.255.255), similar to the format used by IPv4 addresses. This enhancement is intended to simplify the use of route tags as users can now filter routes by using the route tag wildcard mask.

This feature also allows you to configure a default route tag for all internal EIGRP routes without using route maps. Use the eigrp default-route-tag command in address family configuration mode to configure a default route tag for internal EIGRP routes.

#### Enabling Dotted-Decimal Notation for Route Tags
When you enable this feature, route tags will be displayed as dotted decimals in show commands, regardless of whether the tags were configured as dotted decimals.
```
`R1(config)# route-tag notation dotted-decimal
R1(config)# exit
```
`Note this is done in global configuration mode.

#### Setting and Matching a Route Tag in a Route Map
```
`R1(config)# route-map eigrp-to-rip
R1(config-route-map)# set tag 10.10.10.10
R1(config-route-map)# exit
```
````
`R2(config)# route-map eigrp-to-rip
R2(config-route-map)# match tag 10.10.10.10
R2(config-route-map)# exit
R2(config)# router rip
R2(config-router)# redistribute eigrp 7 route-map eigrp-to-rip 5
R2(config-router)# end
```
`
#### Setting and Matching a Route Tag List
```
`R1(config)# route-tag list TAG permit 1.1.1.1 0.0.0.1
R1(config)# route-tag list TAG seq 3 permit 2.2.2.2 0.0.0.3
R1(config)# route-tag list TAG seq 10 permit 3.3.3.3 0.0.0.7
R1(config)# route-tag list TAG seq 15 5.5.5.5 0.0.0.31
R1(config)# route-tag list TAG seq 20 deny 4.4.4.4 0.0.0.4
```
````
`R2(config)# route-map to-ospf
R2(config-route-map)# match tag list TAG
R2(config-route-map)# exit
R2(config)# router ospf 10
R2(config-router)# redistribute eigrp 7 route-map to-ospf metric 20
R2(config-router)# end
```
`
#### Setting a Default Route Tag
The following example shows how to set a default route tag for all internal EIGRP routes without using a route map. Default route tags are supported only in EIGRP named configurations.
```
`R1(config)# router eigrp name
R1(config-router)# address-family ipv4 unicast autonomous-system 1
R1(config-router-af)# eigrp default-route-tag 10.10.10.10
```
`