---
name: 3.5.4.1
title: 3.5.4.1 - MD5
short-title: MD5
category: 3.5 EIGRP
collection: eigrp
layout: page
exam: both
sidebar: eigrp_sidebar
permalink: 3.5.4.1.html
folder: eigrp
---
MD5 is the default authentication mechanism in EIGRP. Like RIP, it uses key chains to define the key strings, and then in interface configuration mode you define the authentication mode and the key chain. Here is an example.
```
R1(config)# key chain R1
R1(config-keychain)# key 1
R1(config-keychain-key)# key string blah55
R1(config-keychain-key)# exit
!
R1(config)# interface gig0/1
R1(config-if)# ip authentication mode eigrp md5
R1(config-if)# ip authentication key-chain eigrp 100 R1
```
Of course, the same configuration would need to be done on the neighboring router with whom we want to authenticate. The key chain names do not need to match, just the key id and key strings.

In classic mode, EIGRP only supports MD5 authentication. In named mode, MD5 and SHA-256 is supported.

To check the authentication mode, use the **show ip eigrp interface detail** command as below.
```
R5#sh ip eigrp interface detail Tunnel0
EIGRP-IPv4 VR(MULTI-AF) Address-Family Interfaces for AS(100)
                              Xmit Queue   PeerQ        Mean   Pacing Time   Multicast    Pending
Interface              Peers  Un/Reliable  Un/Reliable  SRTT   Un/Reliable   Flow Timer   Routes
Tu0                      4        0/0       0/0         327       6/233       1404           0
  Hello-interval is 5, Hold-time is 15
  Split-horizon is disabled
  Next xmit serial <none>
  Packetized sent/expedited: 80/6
  Hello's sent/expedited: 1081/14
  Un/reliable mcasts: 0/52  Un/reliable ucasts: 191/59
  Mcast exceptions: 2  CR packets: 2  ACKs suppressed: 10
  Retransmissions sent: 7  Out-of-sequence rcvd: 2
  Topology-ids on interface - 0
  Authentication mode is HMAC-SHA-256, key-chain is not set
  Topologies advertised on this interface:  base
  Topologies not advertised on this interface:

R5#
```

One thing that can be troublesome with Key Chains, just as we saw with RIP, is that white space in the key-string declaration is hard to diagnose. Ultimately, you can find such an error with the **show key chain** command.
```
R6# show key chain
Key-chain MD5_KEYS: key 1 -- text "CISCO "
```
