---
name: 8.2.2
title: 8.2.2 - Syslog Logging
short-title: Syslog Logging
category: 8.2 Logging
collection: system-management
layout: page
exam: both
sidebar: system_sidebar
permalink: 8.2.2.html
folder: system-management
---
To specify a syslog server to send system messages to, use the **logging host** command.
```
R1(config)# logging host 192.168.17.100
```
You also need to specify which logging facility you are using. This will be configured on the syslog server and the Cisco device configuration must match.
```
R1(config)# logging facility local2
```
You can specify a trap level to limit the types of messages that are sent to the syslog server.
```
R1(config)# logging trap 7
```

You can optionally use TCP for reliable transport. By default messages are sent to the syslog server over UDP.
```
R1(config)# logging host 192.168.17.100 transport tcp port 5000
```

Optionally, you can specify an Origin-ID which will be added to the beginning of all syslog messages sent to the remote host. It is good for marking messages if your syslog server is taking in messages from multiple devices. The output to console, monito, or buffer will not display the Origin-ID, if configured.
```
R1(config)# logging origin-id string "Router 7 Tampa"
```
The quotes are needed if you have spaces in your Origin-ID.
