---
name: 8.2.6
title: 8.2.6 - Configuration Archive and Rollback
short-title: Configuration Archive and Rollback
category: 8.2 Logging
collection: system-management
layout: page
exam: both
sidebar: system_sidebar
permalink: 8.2.6.html
folder: system-management
---
Configuration Archive provides a mechanism to store, organize, and manage an archive of Cisco IOS configuration files. Configuration Replace provides rollback capability in which the current running configuration is replaced with any saved IOS configuration file.

Here are the commands to create a configuration archive:
```
R1(config)# archive
R1(config-archive)# path tftp://myserver/FILE_PREFIX
R1(config-archive)# maximum 14
R1(config-archive)# time-period 10
R1(config-archive)# end
```
The **time-period** command sets the time increment for automatically saving an archive file of the current running configuration.

To rollback to a prior configuration file, use the EXEC command **configure replace**.
```
R1# configure replace tftp://myserver/FILE_PREFIX-1 list time 30
```
The **list** parameter displays a list of the command lines applied by the Cisco IOS software parser during each pass of the configuration replace operation. The **time** keyword and argument specify the time in minutes in which you must enter the **configure confirm** command to approve the rollback. If you need more time you can reset the timer using:
```
R1# configure timer 20
```
If instead you wish to cancel the timed rollback and immediately rollback the configuration file, use this:
```
R1# configure revert now
```
