---
name: 8.5.3
title: 8.5.3 - IOS Menus
short-title: IOS Menus
category: 8.5 Miscellaneous System Management
collection: system-management
layout: page
exam: both
sidebar: system_sidebar
permalink: 8.5.3.html
folder: system-management
---
A menu is a displayed list of actions from which a user can select without knowing anything about the underlying commands. The menu controls the functions that a particular user can access. The command is executed with the privileges of the local user who executed the menu command.
```
Type a number to select an option;
Type 9 to return to the previous menu.

 1     DEC VT420 or similar

 2     Heath H-19

 3     IBM 3051 or equivalent

 4     Macintosh with gterm emulator

 9     Return to previous menu
```
Any user that can enter configuration mode can create menus. A menu can only have a maximum of 18 menu items. Menus containing more than 9 items are automatically configures as sing-spaced menus. If you want a menu with 9 menu items or less to display as single spaced, use the **menu single-space** global configuration command.

Item keys can be numbers, letters, or strings. In order to use strings, you must configure the **menu line-mode** global configuration command.

To begin configuring a menu, you must first give it a menu name and a menu title.
```
R1(config)# menu OPERATOR title # Functions for Network Operators #
```
You can also clear the screen before displaying the message:
```
R1(config)# menu OPERATORS clear-screen
```

There are two parts to configuring an individual menu item. First, you set the menu text, and then you configure the menu item command.
```
R1(config)# menu OPERATOR text 1 Display IP Routing Table
R1(config)# menu OPERATOR command 1 show ip route
```

To create a menu-item the user can select to exit (which you should always do), perform the following:
```
R1(config)# menu OPERATOR text 2 Exit Menu Mode
R1(config)# menu OPERATOR command 2 menu-exit
```

