---
name: 7.4.7
title: 7.4.7 - Filtering Traffic with Time-Based Access-Lists
short-title: Filtering Traffic with Time-Based Access-Lists
category: 7.4 Data Plane Security
collection: security
layout: page
exam: both
sidebar: security_sidebar
permalink: 7.4.7.html
folder: security
---
By default, access list statements are always in effect once they are applied. Time based access lists implement access list entries based on particular times of the day or week. The time range relies on the software clock of the routing device, so you need to ensure that you have a reliable clock source such as NTP.

To configure a time-based access list, you first define the time range and then reference that range in the access list definition.
```
R1(config)# time-range LIMIT_HTTP
R1(config-time-range)# ?
Time range configuration commands:
  absolute  absolute time and date
  default   Set a command to its defaults
  exit      Exit from time-range configuration mode
  no        Negate a command or set its defaults
  periodic  periodic time and date
```
You can see that our choices are absolute and periodic. With absolute, if no **start** or **end** is defined, the access-list goes into effect immediately and lasts indefinitely, really no different than a regular access list.
```
R1(config-time-range)# absolute 00:00 1 Jan 2018 end 23:59 31 Jan 2018
```
The above would define the time range from January 1, 2018 through January 31, 2018.

Periodic time ranges are used to specify a weekly recurring time range.
```
R1(config)# time-range LIMIT_TELNET
R1(config-time-range)#periodic ?
  Friday     Friday
  Monday     Monday
  Saturday   Saturday
  Sunday     Sunday
  Thursday   Thursday
  Tuesday    Tuesday
  Wednesday  Wednesday
  daily      Every day of the week
  weekdays   Monday thru Friday
  weekend    Saturday and Sunday
```
```
R1(config-time-range)# periodic daily 00:00 to 02:00
```

Now that we have a configured time range, we can use it by referencing the time range within an access list.
```
R1(config)# ip access-list extended NO_TELNET
R1(config-ext-nacl)# permit tcp any eq telnet host 192.168.17.1 time-range LIMIT_TELNET
R1(config-ext-nacl)# exit
```
Telnet traffic would be allowed to host 192.168.17.1 between the hours of 12:00 AM to 2:00 AM, but denied outside of that time frame.