---
name: 7.4.4
title: 7.4.4 - IPv6 Traffic Filter
short-title: IPv6 Traffic Filter
category: 7.4 Data Plane Security
collection: security
layout: page
exam: both
sidebar: security_sidebar
permalink: 7.4.4.html
folder: security
---
##### IPv6 Access Lists
IPv6 standard access lists perform much of the same function as IPv4 access lists.

Each IPv6 ACL by default contains permit rules to enable IPv6 enable discovery. These rules can be overridden by explicit deny statements within the ACL. With IPv4, ARP uses a data link protocol, so this traffic was implicitly allowed by IPv4 access lists.

The configuration for IPv6 access lists is shown below.
```
R1(config)# ipv6 access-list OUTBOUND
R1(config-ipv6-acl)# sequence 10 permit ?
  <0-255>             An IPv6 protocol number
  X:X:X:X::X/<0-128>  IPv6 source prefix x:x::y/<z>
  ahp                 Authentication Header Protocol
  any                 Any source prefix
  esp                 Encapsulation Security Payload
  hbh                 Hop by Hop options header
  host                A single source host
  icmp                Internet Control Message Protocol
  ipv6                Any IPv6
  pcp                 Payload Compression Protocol
  sctp                Streams Control Transmission Protocol
  tcp                 Transmission Control Protocol
  udp                 User Datagram Protocol
```
We see the option we have for permitting or denying traffic
```
R1(config-ipv6-acl)# sequence 10 permit tcp 2001:DB8:0300:0201::/32 eq telnet any
R1(config-ipv6-acl)# sequence 20 deny tcp host 2001:DB8:1::1 any log-input
R1(config-ipv6-acl)# exit
```
Now, we need to apply the IPv6 access list to an interface, just as we needed to do in IPv4. With IPv6, instead of **ip access-group** we use the **ipv6 traffic-filter** command.
```
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ipv6 traffic-filter OUTBOUND out
R1(config)# exit
```

What about applying an IPv6 access list to line access?
```
R1(config)# line vty 0 4
R1(config-line)# ipv6 access-class PERMIT_SSH in
```

To see matches on an IPv6 access list, use this:
```
R1# show ipv6 access-list
IPv6 access list inbound
    permit tcp any any eq bgp (8 matches) sequence 10
    permit tcp any any eq telnet  (15 matches) sequence 20
    permit udp any any  sequence 30
IPv6 access list Virtual-Access2.1#427819008151 (per-user)
    permit tcp host 2001:DB8:1::32 eq bgp host 2001:DB8:2::32 eq 11000 sequence 1
    permit tcp host 2001:DB8:1::32 eq telnet host 2001:DB8:2::32 eq 11001 sequence 2
```
##### IPv6 Authentication Header Access Lists

IPv6 access lists also have the capability to filter based on the upper layer protocol, even if an IPSec Authentication Header (AH) is present. This is done by using the **auth** keyword.
```
R1(config)# ipv6 access-list TCP_AH
R1(config-ipv6-acl)# permit tcp any any auth
```
The above will only match tcp packets if an Authentication Header is present. The example below will match any IPv6 traffic with an Authentication Header.
```
R1(config)# ipv6 access-list NO_AH
R1(config-ipv6-acl)# deny ahp any any
```

##### IPv6 Hop by Hop Filtering Access Lists
The IPv6 ACL Extension for Hop by Hop Filtering feature allows you to control IPv6 traffic that might contain hop-by-hop extendion headers. You can configure an ACL to deny all hop-by-hop traffic or to selectively allow it based on protocol.
```
R1(config)# ipv6 access-list NO_HBH
R1(config-ipv6-acl)# deny tcp any any hbh
R1(config-ipv6-acl)# deny udp any any hbh
R1(config-ipv6-acl)# exit
```



